Версия данной администраторской панели v 0.0.1;
На данный момент доступен следующий функционал для администратора сайта: <br>
1) Принятие заявок участников на следующий сезон. <br>
2) Просмотр и редактирование прогресса участников текущего сезона. <br>
3) Редактирование статичной информации. <br>
Функционал в разработке: <br>
1) Просмотр и редактирование даты сезона <br>
2) Просмотр и редактирование информации о пользователе <br>
3) Просмотр и редактирование следующего сезона <br>
4) Инструменты для чтения таблиц базы данных <br>
5) Журнал логов. <br>
6) Просмотр и редактирование учетной записи администратора