Для статической страницы или формы обратной связи фреймворки действительно не нужны.
Движки магазинов, по сути, и есть в какомто смысле фреймворки + определнный функционал написанный на этом фреймворке. Минус здесь в том, что если ты знаешь opencart, но залетает новый заказ на magento, то придется magento изучать с нуля. Там свои подходы и свои решения.

Фреймворк - это всеголишь каркас приложения. Набор слабосвязанных (symfony, zend) или не очень слабо (yii1/2, laravel) компонент, каждая из которых решает какойто аспект (работу с бд, кешем, роутинг запросов, логирование, авторизация, шаблонизация, многоязычность, внедрение зависимотей и прочее)
Сам фреймворк ничего не делает, но он дает инструмент и набор подходов к построению веб-приложения.